test('디폴트로 현재 월의 달력을 보인다.', () => {});

test('미니달력에서 오늘 날짜의 배경색은 blue500이다.', () => {});

test('미니달력에서 선택한 날짜의 배경색은 blue200이다.', () => {});

test('미니달력은 6개의 주로 이루어진다. 첫번째 주는 해당 월의 첫번째 날을 포함하는 주로 시작한다.', () => {});

test('지난달과 다음달의 날짜의 색상은 gray500이다. 현재 달의 날짜의 색상은 gray600이다.', () => {});

test('미니달력의 왼쪽 버튼을 클릭 시 전달로 넘어간다.', () => {});

test('미니달력의 오른쪽 버튼을 클릭 시 다음달로 넘어간다.', () => {});

test('미니달력에서 날짜를 선택시 메인달력에서 해당 날짜가 선택된다.', () => {});

test('헤더에서 왼쪽 및 오른쪽 버튼을 클릭을 통한 날짜 선택이 미니달력에도 같이 반영이 된다.', () => {});
